📝 Update diagram in README
